12/data/attachments/4a4d6136fdaefc07.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_fc850100-1500-4b6b-9730-d02d2e25f44b</nif:username>
            <nif:friendToBeAdded>Michelle_continue_Actions_85629_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>